blog/dns-issue-on-macos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>macOS 系统上的DNS问题</title>
<!-- 2022-06-15 Wed 21:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">macOS 系统上的DNS问题</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 现象描述</a></li>
<li><a href="#sec-2">2. 解决方案</a></li>
</ul>
</div>
</div>
<p>
今天花了很多时间在这个问题上，真是太难受了，不过总算是解决了。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 现象描述</h2>
<div class="outline-text-2" id="text-1">
<p>
前段时间购买了一个dev域名，配置好之后。该系统通过VPN访问，结果发现自己电脑访问不了。但是发现nslookup/dig这个域名都能解析到ip，但是ping/curl却不通。直接ping/curl ip却可以通。是不是感觉很奇怪。
</p>

<p>
刚开始以为是远端系统配置问题，最终在另一台电脑发现一切正常。既然远端系统没问题，那问题就出在我本机电脑。猜测可能是跟DNS有关，于是查看/etc/resolv.conf里nameserver也没有问题。是不是自己配置的dnsmasq的问题或者dnscrypt导致解析出了问题呢。dnscrypt经过排查没有问题，dnsmasq排查也没有发现问题。把两个可能有影响的都卸载掉，再试，依然发现不通。最终经过一番搜索依然一无所获，但却给了一些思路和灵感。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 解决方案</h2>
<div class="outline-text-2" id="text-2">
<p>
查看DNS列表
</p>
<pre class="example">
scutil --dns
</pre>
<p>
突然发现有个dev域名的dns解析到127.0.0.1。这就不对了，我之前是在dnsmasq里/usr/local/etc/dnsmasq.conf配置过，但是已经删除卸载掉了。
</p>
<pre class="example">
address=/dev/127.0.0.1
</pre>

<p>
最后才根据之前配置文档找到之前配置过一个resolver，按图索骥，终于找到之前创建过一个目录和配置
</p>
<pre class="example">
/etc/resolver/dev
nameserver 127.0.0.1
</pre>
<p>
删除掉就好了。
</p>


<p>
参考链接：
</p>
<ul class="org-ul">
<li><a href="https://passingcuriosity.com/2013/dnsmasq-dev-osx/">https://passingcuriosity.com/2013/dnsmasq-dev-osx/</a>
</li>
<li><a href="https://www.v2ex.com/t/353226">https://www.v2ex.com/t/353226</a>
</li>
<li><a href="https://v2ex.com/t/750492">https://v2ex.com/t/750492</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>